app/views/visitors/index.html.erb

	<!--<p><%#= link_to 'Usuarios:', users_path %> <%#= User.count %> registrados</p>-->
	<p><%= link_to 'Clientes:', clientes_path %> <%= Cliente.count %> registrados</p>
---
SELECT COUNT(*) FROM "clientes"