app/controllers/albums_controller.rb

INSERT INTO "albums" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "descripcion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @album = Album.new(album_params)
    flash[:notice] = 'Imagen subida.' if @album.save

UPDATE "albums" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "descripcion" = ?, "updated_at" = ? WHERE "albums"."id" = ?
---
  def update
    flash[:notice] = 'Imagen actualizada.' if @album.update(album_params)

DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 11]]
---
  def destroy
    @album.destroy