app/controllers/clientes_controller.rb

SELECT  "clientes".* FROM "clientes" WHERE (upper(nombre) like '%%')  ORDER BY nombre, fchAc ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "clientes" WHERE (upper(nombre) like '%%')
---
  def index
    @clientes = Cliente.search(params[:search], params[:page])

INSERT INTO "clientes" ("nombre", "telefono", "celular", "barrio", "direccion", "refdir", "hora", "ocacion", "valor", "fecha", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @cliente = Cliente.new(cliente_params)
    flash[:notice] = 'El cliente fue creado exitosamente.' if @cliente.save

UPDATE "clientes" SET "telefono" = ?, "updated_at" = ? WHERE "clientes"."id" = ?  [["telefono", "1234567890"], ["updated_at", "2015-11-25 18:13:22.452957"], ["id", 2]]
---
  def update
    flash[:notice] = 'El cliente fue actualizado exitosamente.' if @cliente.update(cliente_params)

DELETE FROM "clientes" WHERE "clientes"."id" = ?  [["id", 8]]
---
  def destroy
    @cliente.destroy