app/controllers/pronums_controller.rb

SELECT "pronums".* FROM "pronums"
---
  def index
    @pronums = Pronum.all

INSERT INTO "pronums" ("num1", "num2", "num3", "num4", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["num1", "1"], ["num2", "2"], ["num3", "3"], ["num4", "4"], ["created_at", "2016-08-12 20:29:42.912752"], ["updated_at", "2016-08-12 20:29:42.912752"]]
---
  def create
    @pronum = Pronum.new(pronum_params)
    flash[:notice] = 'Suerte con estos números.' if @pronum.save

UPDATE "pronums" SET "num1" = ?, "num2" = ?, "num3" = ?, "num4" = ?, "updated_at" = ? WHERE "pronums"."id" = ?  [["num1", "4"], ["num2", "3"], ["num3", "2"], ["num4", "1"], ["updated_at", "2016-08-24 03:09:49.661626"], ["id", 4]]
---
  def update
    flash[:notice] = 'Nuevas probabilidades.' if @pronum.update(pronum_params)

DELETE FROM "pronums" WHERE "pronums"."id" = ?  [["id", 2]]
---
  def destroy
    @pronum.destroy

SELECT  "pronums".* FROM "pronums" WHERE "pronums"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_pronum
      @pronum = Pronum.find(params[:id])